[AshMutonDestroyerM1 X2CharacterTemplate]
strCharacterName = "Muton Destroyer"

[AshMutonDestroyerM2 X2CharacterTemplate]
strCharacterName = "Muton Devastator"

[AshMutonDestroyerM3 X2CharacterTemplate]
strCharacterName = "Muton Decimator"

[AshMutonDestroyerM4 X2CharacterTemplate]
strCharacterName = "Muton Leviathan"

[Weapon_AshMutonDestroyerRifleM1 X2WeaponTemplate]
FriendlyName = "Concussion Rifle"
TacticalText = "<bullet/> Firing the primary weapon always ends the soldier's turn."
BriefSummary = "Heavy beam rifle carried by the Muton Destroyer."

[Weapon_AshMutonDestroyerRifleM2 X2WeaponTemplate]
FriendlyName = "Concussion Rifle"
TacticalText = "<bullet/> Firing the primary weapon always ends the soldier's turn."
BriefSummary = "Heavy beam rifle carried by the Muton Destroyer."

[Weapon_AshMutonDestroyerRifleM3 X2WeaponTemplate]
FriendlyName = "Concussion Rifle"
TacticalText = "<bullet/> Firing the primary weapon always ends the soldier's turn."
BriefSummary = "Heavy beam rifle carried by the Muton Destroyer."

[Weapon_AshConcussionGrenadeAlien X2GrenadeTemplate]
FriendlyName = "Concussion Grenade"
FriendlyNamePlural = "Concussion Grenades"
BriefSummary = "Upon detonation, the Concussion Grenade unleashes a shockwave that disorients and/or stuns enemies in a large area.  Additionally, weak structures and objects may be damaged or destroyed."
TacticalText="<Bullet/> Concussion Grenades don't do damage, but disorient and/or stun enemies in a large area.<br><Bullet/> Weak structures and objects may be damaged or destroyed.<br><Bullet/> Friendly squad members will not be affected."
ThrownAbilityName = "Throw Concussion Grenade"
ThrownAbilityHelpText = "Disorient, with a chance to stun, all hostile targets in the affected area.  Weak cover will be destroyed."
LaunchedAbilityname = "Launch Concussion Grenade"
LaunchedAbilityHelpText = "Disorient, with a chance to stun, all hostile targets in the affected area.  Weak cover will be destroyed."

[Weapon_AshConcussionGrenadeXCom X2GrenadeTemplate]
FriendlyName = "Concussion Grenade"
FriendlyNamePlural = "Concussion Grenades"
BriefSummary = "Upon detonation, the Concussion Grenade unleashes a shockwave that disorients and/or stuns enemies in a large area.  Additionally, weak structures and objects may be damaged or destroyed."
TacticalText="<Bullet/> Concussion Grenades don't do damage, but disorient and/or stun enemies in a large area.<br><Bullet/> Weak structures and objects may be damaged or destroyed.<br><Bullet/> Friendly squad members will not be affected."
ThrownAbilityName = "Throw Concussion Grenade"
ThrownAbilityHelpText = "Disorient, with a chance to stun, all hostile targets in the affected area.  Weak cover will be destroyed."
LaunchedAbilityname = "Launch Concussion Grenade"
LaunchedAbilityHelpText = "Disorient, with a chance to stun, all hostile targets in the affected area.  Weak cover will be destroyed."

[Ability_AshDamperFieldAlien X2AbilityTemplate]
locFriendlyName = "Damper Field"
locLongDescription = "Reduces incoming damage.  Melee, Fire, Acid, Poison, and Psionic attacks penetrate the Damper Field."
locHelpText = "Surrounds all allies within range with a Damper Field for a limited time."
locFlyOverText = "Damper Field"

[Ability_AshDamperFieldXCom X2AbilityTemplate]
locFriendlyName = "Damper Field"
locLongDescription = "Reduces incoming damage by 50% for a limited time.  Melee, Fire, Acid, Poison, and Psionic attacks penetrate the Damper Field."
locHelpText = "Reduces incoming damage by 50% for a limited time.  Melee, Fire, Acid, Poison, and Psionic attacks penetrate the Damper Field."
locFlyOverText = "Damper Field"

[Ability_AshEviscerate X2AbilityTemplate]
locFriendlyName = "Eviscerate"
locLongDescription = "<bullet/> A devastating melee attack that ruptures its target."
locHelpText = "A devastating melee attack that ruptures its target."
locFlyOverText = "Eviscerate"

[Ability_AshRetaliateListener X2AbilityTemplate]
locFriendlyName = "Retaliate"
locLongDescription = "If the Muton Destroyer dodges a melee attack, it will strike back with Eviscerate."

[Ability_AshRetaliatePassive X2AbilityTemplate]
locFriendlyName = "Retaliate"
locLongDescription = "After dodging an incoming melee attack, Muton Destroyers will seize the opening to unleash an eviscerating strike."

[Ability_AshConcussionBlast X2AbilityTemplate]
locFriendlyName = "Concussion Blast"
locLongDescription = "<bullet/> Destroys cover and disorients its target."
locHelpText = "Destroys cover and disorients its target."
locFlyOverText = "Concussion Blast"

[Ability_AshDestroyerArmorAlien X2AbilityTemplate]
locFriendlyName = "Destroyer Armor"
locLongDescription = "Muton Destroyers are immune to various types of damage."
locHelpText = "Muton Destroyers are immune to various types of damage."
locFlyOverText = "Destroyer Armor"

[Ability_AshDestroyerArmorXCom X2AbilityTemplate]
locFriendlyName = "Destroyer Armor Plating"
locLongDescription = "Provides immunity to explosions and 1 point of additional armor."
locHelpText = "Provides immunity to explosions and 1 point of additional armor."
locFlyOverText = "Destroyer Armor Plating"

[Ability_AshPsionicInstability X2AbilityTemplate]
locFriendlyName = "Psionic Instability"
locLongDescription = "Muton Destroyers are extremely strong willed or have smashed their heads through too many walls.  Whatever the case, they are highly resistant to panic and mind control yet suffer increased damage from Psionic attacks."
locHelpText = "Muton Destroyers are extremely strong willed or have smashed their heads through too many walls.  Whatever the case, they are highly resistant to panic and mind control yet suffer increased damage from Psionic attacks."
locFlyOverText = "Psionic Instability"

[Ability_AshClumsy X2AbilityTemplate]
locFriendlyName = "Clumsy"
locLongDescription = "Stumbling across the battefield, the Muton Destroyer sometimes loses its footing in the destruction it creates."
locHelpText = "Stumbling across the battefield, the Muton Destroyer sometimes loses its footing in the destruction it creates."
locFlyOverText = "Clumsy"

[Ability_AshClumsyPassive X2AbilityTemplate]
locFriendlyName = "Clumsy"
locLongDescription = "Stumbling across the battefield, the Muton Destroyer sometimes loses its footing in the destruction it creates."
locHelpText = "Stumbling across the battefield, the Muton Destroyer sometimes loses its footing in the destruction it creates."
locFlyOverText = "Clumsy"

[Ability_AshPoorManners X2AbilityTemplate]
locFriendlyName = "Poor Manners"
locLongDescription = "Muton Destroyers are inelegant creatures, preferring the wall to the door."
locHelpText = "Muton Destroyers are inelegant creatures; preferring the wall to the door."
locFlyOverText = "Poor Manners"

[Ability_AshPoorMannersPassive X2AbilityTemplate]
locFriendlyName = "Poor Manners"
locLongDescription = "Muton Destroyers are inelegant creatures, preferring the wall to the door."
locHelpText = "Muton Destroyers are inelegant creatures, preferring the wall to the door."
locFlyOverText = "Poor Manners"

[UtilityItem_AshDestroyerVest X2EquipmentTemplate]
FriendlyName = "Destroyer Vest"
FriendlyNamePlural = "Destroyer Vests"
TacticalText = "<bullet/> Increases soldier health and armor.\n<bullet/> Incorporates a personal Damper Field.\n<bullet/> Provides immunity to explosions.\n<bullet/> Activating the Damper Field does not end the soldier's turn."
BriefSummary = "We've managed to reverse engineer the lightweight armor suit of the Muton Destroyer.  Utilizing our new knowledge, we've created a plated armor vest that protects from explosions and incorporates a rudimentary Damper Field.  Once activated, the Damper Field will provide increades protection for the equipped soldier for a short time."

[Corpse_AshMutonDestroyer X2ItemTemplate]
FriendlyName = "Muton Destroyer Corpse"
FriendlyNamePlural = "Muton Destroyer Corpses"
BriefSummary = "The ritualistic scars of this Muton specimen are numerous and deep.  Perhaps the Destroyer's tribal conditioning explains their tolerance for pain and lack of self-preservation in combat."

[Autopsy_AshMutonDestroyer X2TechTemplate]
DisplayName = "Muton Destroyer Autopsy"
Summary = "The Destroyer variant of the aliens' shock troop is stronger and more reckless than previously encountered Mutons.  They have no trouble crashing through walls to engage our soldiers in close quarters while relying on damper fields and concussion weaponry.  With time and research, perhaps we can replicate this technology."
CodeName = "K-A Man"
LongDescription = "After careful analysis, it appears this species of Muton bears ritualistic scars indicative of deadly personal combat.  They are stronger than the typical Mutons encountered in the field and far more aggressive.  It would not be unreasonable to conclude that the aliens used the Destroyer as a blueprint for the genetic experiments that produced the Berserker.  On the other hand, perhaps the Destroyer is the result of such experiments that failed; leaving the aliens with a shock trooper suffering from blind rage but subpar survivability.  A less than satisfactory asset, indeed.\n\nTo compensate, the introduction of damper technology and deployment of concussion weapons would greatly improve the success rate of the Destroyer in the field.  Now, instead of a failed experiment, the aliens have a terrifyingly effective troop to engage our forces.\n\nOf course, that is just one possibility.\n\nI suppose we may never know.  R. Tygan."

[ProvingGround_AshConcussionGrenades X2TechTemplate]
DisplayName = "Concussion Grenade"
Summary = "Studying the aliens' shockwave ordinance, we believe we can reproduce the Muton Destroyer's Elerium-based Concussion Grenade.  This project will provide our soldiers with the means to flush enemy targets out of heavy cover while disorienting their senses."

